{
  "recent": [
    {
      "company": "IMPEL Consulting (part of ArkusNexus)",
      "role": "VP of Solutions",
      "period": "2024 – Present",
      "bullets_en": [
        "Lead software development and delivery teams for enterprise systems, Salesforce implementations, and custom AI-driven applications.",
        "Define project strategies and oversee execution across ArkusNexus’ consulting ecosystem, ensuring alignment with U.S. client objectives.",
        "Direct recruitment and allocation of both permanent consultants and freelancers within IMPEL Consulting (not across Arkus overall), balancing capacity with project demands.",
        "Manage process design, agile delivery, and cross-functional collaboration across multiple departments.",
        "Drive innovation by integrating AI-assisted development tools to accelerate delivery and improve solution quality."
      ],
      "bullets_es": [
        "Lidera equipos de desarrollo y entrega para sistemas empresariales, implementaciones de Salesforce y aplicaciones a la medida impulsadas por IA.",
        "Define estrategias y supervisa la ejecución dentro del ecosistema de consultoría de ArkusNexus, alineado con objetivos de clientes en EE. UU.",
        "Dirige el reclutamiento y asignación de consultores permanentes y freelancers dentro de IMPEL Consulting (no a nivel Arkus completo), equilibrando capacidad vs. demanda de proyectos.",
        "Gestiona diseño de procesos, entregas ágiles y colaboración multidisciplinaria.",
        "Impulsa la adopción de herramientas de desarrollo asistidas por IA para acelerar entregas y elevar la calidad."
      ]
    },
    {
      "company": "Nice2Chat",
      "role": "General Director",
      "period": "2021 – 2023",
      "bullets_en": [
        "Served as the company’s first General Director, establishing its operational and administrative foundations.",
        "Oversaw recruitment, training, and development for operational and administrative teams.",
        "Defined and optimized processes for quality assurance, performance tracking, and client communication.",
        "Introduced automation and analytics systems to improve efficiency and visibility.",
        "Managed strategic negotiations with clients and vendors; represented the company in executive-level presentations."
      ],
      "bullets_es": [
        "Primer Director General de la empresa; creó y consolidó estructuras operativas y administrativas.",
        "Supervisó reclutamiento, capacitación y desarrollo de equipos operativos y administrativos.",
        "Definió y optimizó procesos de calidad, métricas de desempeño y comunicación con clientes.",
        "Implementó automatización y analítica para mejorar eficiencia y visibilidad.",
        "Condujo negociaciones estratégicas y representó a la empresa ante ejecutivos y socios."
      ]
    },
    {
      "company": "Baja Call Center",
      "role": "Training & Quality Manager (GUESS Campaign) — promoted from Sales Training Instructor",
      "period": "2018 – 2021",
      "bullets_en": [
        "Designed and implemented training programs for sales and customer-service teams in alignment with client standards.",
        "Supervised quality-control teams to ensure consistent performance and compliance.",
        "Built reporting frameworks to evaluate training outcomes and service quality.",
        "Maintained direct communication with U.S. corporate clients to align objectives and outcomes."
      ],
      "bullets_es": [
        "Diseñó e implementó programas de capacitación para ventas y atención al cliente alineados a estándares del cliente.",
        "Dirigió equipos de control de calidad, asegurando cumplimiento y consistencia operativa.",
        "Construyó marcos de reporte para medir impacto de la capacitación y calidad del servicio.",
        "Mantuvo comunicación directa con corporativo en EE. UU. para alinear objetivos y resultados."
      ]
    }
  ],
  "older_collapsed": [
    {
      "company": "Verde & Punto",
      "role": "Co-propietario y Gerente de Operaciones",
      "period": "2016 – 2019",
      "bullets_es": [
        "Operación diaria, finanzas y marketing en negocio de hospitalidad.",
        "Sistemas de control para inventarios, costos y ventas.",
        "Reclutamiento, capacitación y evaluación de desempeño.",
        "Branding y publicidad para posicionamiento local."
      ],
      "bullets_en": [
        "Managed daily operations, finances, and marketing for a hospitality business.",
        "Implemented control systems for inventory, cost, and sales management.",
        "Supervised hiring, training, and performance evaluation.",
        "Directed branding and advertising strategies for local positioning."
      ]
    },
    {
      "company": "City of Tijuana",
      "role": "Deputy Director of Urban Cleaning — promoted from Chief Inspector (Public Services) and Assistant Director (Youth Institute)",
      "period": "2010 – 2016",
      "bullets_en": [
        "Designed and implemented citywide cleaning and waste-collection programs.",
        "Supervised municipal inspection teams and enforced urban regulations.",
        "Led a regulatory reform for the City’s Cleaning Ordinance, improving efficiency and compliance.",
        "Collaborated with civil-society organizations to optimize environmental initiatives."
      ],
      "bullets_es": [
        "Diseño/implementación de programas de limpieza y recolección a nivel ciudad.",
        "Supervisión de inspectores municipales y cumplimiento normativo.",
        "Reforma del Reglamento de Limpia para eficiencia y cumplimiento.",
        "Colaboración con organizaciones civiles para optimizar iniciativas ambientales."
      ]
    },
    {
      "company": "Plantronics México",
      "role": "Escalation Specialist & Training Lead — promoted from Technical Support Agent",
      "period": "2008 – 2010",
      "bullets_en": [
        "Provided advanced technical support and resolved escalated customer cases for U.S. markets.",
        "Trained new agents in troubleshooting and client communication.",
        "Delivered MCDST training and standardized support processes.",
        "Improved documentation and knowledge base usage across teams."
      ],
      "bullets_es": [
        "Soporte técnico avanzado y resolución de casos escalados para el mercado de EE. UU.",
        "Capacitación a nuevos agentes en troubleshooting y comunicación.",
        "Entrenamiento MCDST y estandarización de procesos de soporte.",
        "Mejora de documentación y uso de knowledge base a nivel equipo."
      ]
    },
    {
      "company": "Vinequimed",
      "role": "Fundador y Especialista Biomédico",
      "period": "2006 – 2010",
      "bullets_es": [
        "Mantenimiento preventivo/correctivo de equipo médico (sector público/privado).",
        "Capacitación a personal de salud en uso seguro y eficiente.",
        "Gestión de contratos, clientes y operación en sitio."
      ],
      "bullets_en": [
        "Preventive/corrective maintenance of medical equipment for public and private institutions.",
        "Training for healthcare personnel in safe and efficient equipment use.",
        "Managed contracts, client relationships, and on-site operations."
      ]
    },
    {
      "company": "Hospital Ángeles Tijuana (Grupo Ángeles)",
      "role": "Jefe de Ingeniería Biomédica",
      "period": "2005 – 2006",
      "bullets_es": [
        "Programa de soporte biomédico; compra e instalación de equipo crítico.",
        "Capacitación a personal médico/paramédico en operación y mantenimiento."
      ],
      "bullets_en": [
        "Biomedical support program; procurement and installation of critical medical equipment.",
        "Training for medical and paramedical staff in operation and maintenance."
      ]
    },
    {
      "company": "Hospitales Puerta de Hierro",
      "role": "Ingeniero Biomédico → Jefe de Adquisición de Equipo Médico",
      "period": "2003 – 2005",
      "bullets_es": [
        "Supervisión de instalación de equipos durante la construcción.",
        "Adquisición de dispositivos e infraestructura técnica.",
        "Puesta en marcha de procesos administrativos y de ingeniería."
      ],
      "bullets_en": [
        "Supervised equipment installation during hospital construction.",
        "Managed procurement for medical devices and technical infrastructure.",
        "Set up administrative and engineering processes during opening."
      ]
    },
    {
      "company": "Secundaria José Vasconcelos",
      "role": "Profesor (Matemáticas, Física y Biología)",
      "period": "2007 – 2008",
      "bullets_es": [
        "Desarrollo e impartición de currícula STEM.",
        "Fomento del pensamiento crítico y resolución de problemas."
      ],
      "bullets_en": [
        "Developed and taught STEM curricula.",
        "Fostered analytical thinking and problem-solving."
      ]
    }
  ]
}


